descent/stm32f4_prog/spi_sdcard/myur_168M.cpp
u8 TM_SPI_Send(SPI_TypeDef* SPIx, u8 data) {
        /* Fill output buffer with data */
        SPIx->DR = data;
        /* Wait for transmission to complete */
        while (!SPI_I2S_GetFlagStatus(SPIx, SPI_I2S_FLAG_TXE));
        /* Wait for received data to complete */
        while (!SPI_I2S_GetFlagStatus(SPIx, SPI_I2S_FLAG_RXNE));
        /* Wait for SPI to be ready */
        while (SPI_I2S_GetFlagStatus(SPIx, SPI_I2S_FLAG_BSY));
        /* Return data from buffer */
        return SPIx->DR;
}
/* Exchange a byte */
static u8 xchg_spi (
        u8 dat        /* Data to send */
)
{
        //FATFS_DEBUG_SEND_USART("xchg_spi: inside");
        return TM_SPI_Send(SPI1, dat);
}


#define FATFS_USE_DETECT_PIN_PORT                       GPIOA
#define FATFS_USE_DETECT_PIN_PIN                        GPIO_Pin_6

#define STA_NODISK -1

u8 TM_FATFS_Detect(void) 
{
#if FATFS_USE_DETECT_PIN > 0
        return GPIO_ReadInputDataBit(FATFS_USE_DETECT_PIN_PORT, FATFS_USE_DETECT_PIN_PIN) == Bit_RESET;
#else
        return 1;
#endif
}

#define FATFS_DEBUG_SEND_USART(str)       ur_puts(USART2, str)

/* MMC/SD command */
#define CMD0	(0)			/* GO_IDLE_STATE */
#define CMD1	(1)			/* SEND_OP_COND (MMC) */
#define	ACMD41	(0x80+41)	/* SEND_OP_COND (SDC) */
#define CMD8	(8)			/* SEND_IF_COND */
#define CMD9	(9)			/* SEND_CSD */
#define CMD10	(10)		/* SEND_CID */
#define CMD12	(12)		/* STOP_TRANSMISSION */
#define ACMD13	(0x80+13)	/* SD_STATUS (SDC) */
#define CMD16	(16)		/* SET_BLOCKLEN */
#define CMD17	(17)		/* READ_SINGLE_BLOCK */
#define CMD18	(18)		/* READ_MULTIPLE_BLOCK */
#define CMD23	(23)		/* SET_BLOCK_COUNT (MMC) */
#define	ACMD23	(0x80+23)	/* SET_WR_BLK_ERASE_COUNT (SDC) */
#define CMD24	(24)		/* WRITE_BLOCK */
#define CMD25	(25)		/* WRITE_MULTIPLE_BLOCK */
#define CMD32	(32)		/* ERASE_ER_BLK_START */
#define CMD33	(33)		/* ERASE_ER_BLK_END */
#define CMD38	(38)		/* ERASE */
#define CMD55	(55)		/* APP_CMD */
#define CMD58	(58)		/* READ_OCR */


#define FATFS_CS_PORT                                           GPIOA
#define FATFS_CS_PIN                                            GPIO_Pin_15

#define FATFS_CS_LOW                                            FATFS_CS_PORT->BSRRH = FATFS_CS_PIN
#define FATFS_CS_HIGH                                           FATFS_CS_PORT->BSRRL = FATFS_CS_PIN

__IO u32 TM_Time2 = 0;


#define TM_DELAY_SetTime2(time) (TM_Time2 = (time))
#define TM_DELAY_Time2() (TM_Time2)


static int wait_ready ( /* 1:Ready, 0:Timeout */
        u32 wt                 /* Timeout [ms] */
)
{
        u8 d;

        TM_DELAY_SetTime2(wt);
        do {
                d = xchg_spi(0xFF);
        } while (d != 0xFF && TM_DELAY_Time2());        /* Wait for card goes ready or timeout */
        if (d == 0xFF) {
                FATFS_DEBUG_SEND_USART("wait_ready: OK");
        } else {
                FATFS_DEBUG_SEND_USART("wait_ready: timeout");
        }
        return (d == 0xFF) ? 1 : 0;
}

/*-----------------------------------------------------------------------*/
/* Deselect card and release SPI                                         */
/*-----------------------------------------------------------------------*/

static void deselect (void)
{
        FATFS_CS_HIGH;                  /* CS = H */
        xchg_spi(0xFF);                 /* Dummy clock (force DO hi-z for multiple slave SPI) */
        FATFS_DEBUG_SEND_USART("deselect: ok");
}


/*-----------------------------------------------------------------------*/
/* Select card and wait for ready                                        */
/*-----------------------------------------------------------------------*/

static int select (void)        /* 1:OK, 0:Timeout */
{
        FATFS_CS_LOW;
        xchg_spi(0xFF); /* Dummy clock (force DO enabled) */

        if (wait_ready(500)) {
                FATFS_DEBUG_SEND_USART("select: OK");
                return 1;       /* OK */
        }
        FATFS_DEBUG_SEND_USART("select: no");
        deselect();
        return 0;       /* Timeout */
}

/*-----------------------------------------------------------------------*/
/* Send a command packet to the MMC                                      */
/*-----------------------------------------------------------------------*/

static u8 send_cmd (		/* Return value: R1 resp (bit7==1:Failed to send) */
	u8 cmd,		/* Command index */
	u32 arg		/* Argument */
)
{
	u8 n, res;

	FATFS_DEBUG_SEND_USART("send_cmd: inside");
	
	if (cmd & 0x80) {	/* Send a CMD55 prior to ACMD<n> */
		FATFS_DEBUG_SEND_USART("send_cmd: 0x80 bit set");
		cmd &= 0x7F;
		res = send_cmd(CMD55, 0);
		if (res > 1) return res;
	}

	/* Select the card and wait for ready except to stop multiple block read */
	if (cmd != CMD12) {
		FATFS_DEBUG_SEND_USART("send_cmd: cmd != CMD12");
		deselect();
		if (!select()) return 0xFF;
	}

	/* Send command packet */
	xchg_spi(0x40 | cmd);				/* Start + command index */
	xchg_spi((u8)(arg >> 24));		/* Argument[31..24] */
	xchg_spi((u8)(arg >> 16));		/* Argument[23..16] */
	xchg_spi((u8)(arg >> 8));			/* Argument[15..8] */
	xchg_spi((u8)arg);				/* Argument[7..0] */
	n = 0x01;							/* Dummy CRC + Stop */
	if (cmd == CMD0) n = 0x95;			/* Valid CRC for CMD0(0) */
	if (cmd == CMD8) n = 0x87;			/* Valid CRC for CMD8(0x1AA) */
	xchg_spi(n);

	/* Receive command resp */
	if (cmd == CMD12) {
		FATFS_DEBUG_SEND_USART("send_cmd: CMD12, receive command resp");
		xchg_spi(0xFF);					/* Diacard following one byte when CMD12 */
	}
	n = 10;								/* Wait for response (10 bytes max) */
	do
		res = xchg_spi(0xFF);
	while ((res & 0x80) && --n);

	return res;							/* Return received response */
}


void RCC_APB2PeriphClockCmd(uint32_t RCC_APB2Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_APB2_PERIPH(RCC_APB2Periph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  { 
    RCC->APB2ENR |= RCC_APB2Periph;
  }
  else
  {
    RCC->APB2ENR &= ~RCC_APB2Periph;
  }
}

void SPI_Init(SPI_TypeDef* SPIx, SPI_InitTypeDef* SPI_InitStruct)
{
  uint16_t tmpreg = 0;
  
  /* check the parameters */
  assert_param(IS_SPI_ALL_PERIPH(SPIx));
  
