descent/stm32f4_prog/spi_sdcard/myur_168M.cpp
#if 0
                SPI_InitStruct.SPI_CPOL = SPI_CPOL_Low;
                SPI_InitStruct.SPI_CPHA = SPI_CPHA_2Edge;

                SPI_InitStruct.SPI_CPOL = SPI_CPOL_High;
                SPI_InitStruct.SPI_CPHA = SPI_CPHA_1Edge;

                SPI_InitStruct.SPI_CPOL = SPI_CPOL_High;
                SPI_InitStruct.SPI_CPHA = SPI_CPHA_2Edge;
#endif
        
  SPI_InitStruct.SPI_NSS = SPI_NSS_Soft;
  SPI_Init(SPI1, &SPI_InitStruct);
  SPI_Cmd(SPI1, ENABLE);


  if (!TM_FATFS_Detect()) 
  {
    //fio_printf(1, "STA_NODISK %X\r\n", STA_NODISK);
    return STA_NODISK;
  }

  for (int n = 10; n; n--) 
    xchg_spi(0xFF);

  if (send_cmd(CMD0, 0) == 1) /* Put the card SPI/Idle state */
  {
  }

#if 0



  init_usart(115200);
  ur_puts(USART2, "Init complete! Hello World!\r\n");

  RCC_ClocksTypeDef RCC_ClocksStatus;
  RCC_GetClocksFreq(&RCC_ClocksStatus);

  char str[20]="";

  s32_itoa(RCC_ClocksStatus.SYSCLK_Frequency, str, 10);
  ur_puts(USART2, "SYSCLK_Frequency: ");
  ur_puts(USART2, str);
  ur_puts(USART2, "\r\n");

  s32_itoa(RCC_ClocksStatus.HCLK_Frequency, str, 10);
  ur_puts(USART2, "HCLK_Frequency: ");
  ur_puts(USART2, str);
  ur_puts(USART2, "\r\n");

  s32_itoa(RCC_ClocksStatus.PCLK1_Frequency, str, 10);
  ur_puts(USART2, "PCLK1_Frequency: ");
  ur_puts(USART2, str);
  ur_puts(USART2, "\r\n");

  s32_itoa(RCC_ClocksStatus.PCLK2_Frequency, str, 10);
  ur_puts(USART2, "PCLK2_Frequency: ");
  ur_puts(USART2, str);
  ur_puts(USART2, "\r\n");

#if 0
  uint32_t SYSCLK_Frequency; /*!<  SYSCLK clock frequency expressed in Hz */
  uint32_t HCLK_Frequency;   /*!<  HCLK clock frequency expressed in Hz */
  uint32_t PCLK1_Frequency;  /*!<  PCLK1 clock frequency expressed in Hz */
  uint32_t PCLK2_Frequency;  /*!<  PCLK2 clock frequency expressed in Hz */
#endif

  while(1)
  {
    char ch = get_byte();
    if (ch == '\r') // enter, 0x13
      ur_puts(USART2, "\r\n");
    else
      USART_SendData(USART2, ch);
    //send_string("ur output\n");
  }
#endif
}

void int_isr(void)
{
}

